tutorials/floatRigidBody/trial_cases/floatRigidBody_monolithic_nOuter8/0.orig/beamone/Gamma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      Gamma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<vector> 
39
(
(0.000458702275253 -3.58855607468e-18 -1.21872308317e-05)
(0.000459501654777 -2.77406126843e-18 -9.4177478664e-06)
(0.000460302178277 -2.14120781168e-18 -7.26477999125e-06)
(0.00046110515564 -1.6496521916e-18 -5.5914098562e-06)
(0.000461911366786 -1.26789832785e-18 -4.29103078604e-06)
(0.000462721271903 -9.71382348298e-19 -3.2806530803e-06)
(0.000463535138442 -7.40948479462e-19 -2.49568198065e-06)
(0.000464353117766 -5.61721627444e-19 -1.88584512848e-06)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-0.000457901852413 -3.39194685737e-13 1.57490324742e-05);
    }
    right
    {
        type            calculated;
        value           uniform (0.000492661839828 -3.39195032679e-13 1.45696638892e-05);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
